Revit 2027 API
ExternalService.GetRegisteredServerIds Method
 Returns Ids of all servers registered for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Guid> GetRegisteredServerIds()
Public Function GetRegisteredServerIds As IList(Of Guid)
public:
IList<Guid>^ GetRegisteredServerIds()
member GetRegisteredServerIds : unit -> IList<Guid>
Return Value
IList<Guid>
 An array of Ids of all registered servers. The array may be empty.
Remarks
 The list includes all registered servers regardless of whether they are currently active or not.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace